In [1]:
# import
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40],
                  'E':[12,14,5,np.nan]})

In [7]:
df

     A    B   C     E
0  1.0  5.0  10  12.0
1  2.0  NaN  20  14.0
2  NaN  NaN  30   5.0
3  4.0  8.0  40   NaN

In [12]:
# remove rows with any Nan
df.dropna()

     A    B   C     E
0  1.0  5.0  10  12.0

In [13]:
# remove columns with any Nan
df.dropna(1)

    C
0  10
1  20
2  30
3  40

In [14]:
# remove columns with non-null=>3
df.dropna(1,thresh=3)

     A   C     E
0  1.0  10  12.0
1  2.0  20  14.0
2  NaN  30   5.0
3  4.0  40   NaN

In [21]:
# remove columns with non-null=> 75% 
prc = 0.75*len(df)
df.dropna(1,thresh=prc)

     A   C     E
0  1.0  10  12.0
1  2.0  20  14.0
2  NaN  30   5.0
3  4.0  40   NaN

In [35]:
# fill df with "Fill Value" + check type 
df1 = df.fillna('Fill Value')
df2 = df.fillna(0)
df1

            A           B   C           E
0           1           5  10          12
1           2  Fill Value  20          14
2  Fill Value  Fill Value  30           5
3           4           8  40  Fill Value

In [36]:
df1.dtypes

A    object
B    object
C     int64
E    object
dtype: object

In [37]:
df2.dtypes

A    float64
B    float64
C      int64
E    float64
dtype: object

In [39]:
# fill column 'A' with (0) "in-place" 
df2

     A    B   C     E
0  1.0  5.0  10  12.0
1  2.0  0.0  20  14.0
2  0.0  0.0  30   5.0
3  4.0  8.0  40   0.0

In [47]:
# impute column 'B' using mean 
df['B'].fillna(df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [48]:
df

     A    B   C     E
0  1.0  5.0  10  12.0
1  2.0  NaN  20  14.0
2  NaN  NaN  30   5.0
3  4.0  8.0  40   NaN

In [50]:
# impute df 
df.fillna(df.mean())

          A    B   C          E
0  1.000000  5.0  10  12.000000
1  2.000000  6.5  20  14.000000
2  2.333333  6.5  30   5.000000
3  4.000000  8.0  40  10.333333